app/Controllers/Forums.php

SELECT *
FROM `forums`
---
	public function getForums(){
		$id = $this->request->getPost('id');
		$forumModel = new ForumsModel();
		if($id){
			$data['forums'] = $forumModel->where('id', $id)->findAll();
			echo json_encode($data['forums']);
		} else {
			$data['forums'] = $forumModel->findAll();