app/Controllers/Replies.php

SELECT `replies`.*, `u`.`username`
FROM `replies`
JOIN `threads` as `t` ON `replies`.`thread_id` = `t`.`id`
JOIN `users` as `u` ON `replies`.`user_id` = `u`.`id`
WHERE `t`.`id` = '2'
---
	public function getReplies($id=''){
		$model = new RepliesModel();

		$data['replies'] = $model->select('replies.*, u.username')
								->join('threads as t', 'replies.thread_id = t.id')
								->join('users as u', 'replies.user_id = u.id')->where('t.id',$id)->findAll();

SELECT *
FROM `replies`
---
	public function getData(){
		$id = $this->request->getPost('id');
		$model = new RepliesModel();
		if($id){
			$data['replies'] = $model->where('id', $id)->findAll();
			echo json_encode($data['replies']);
		} else {
			$data['replies'] = $model->findAll();