app/Controllers/Threads.php

SELECT *
FROM `threads`
---
	public function getData(){
		$id = $this->request->getPost('id');
		$model = new ThreadsModel();
		if($id){
			$data['threads'] = $model->where('id', $id)->findAll();
			echo json_encode($data['threads']);
		} else {
			$data['threads'] = $model->findAll();