app/Controllers/Users.php

	public function getData(){
		$id = $this->request->getPost('id');
		$model = new UsersModel();
		if($id){
			$data['users'] = $model->where('id', $id)->findAll();
			echo json_encode($data['users']);
		} else {
			$data['users'] = $model->findAll();
---
SELECT *
FROM `users`
WHERE `id` = '1'
SELECT *
FROM `users`

	public function getUserLog(){
		$model = new UserLogModel();
		$data['users'] = $model->findAll();
---
SELECT *
FROM `user_log`