app/Models/ForumsModel.php

	public function latestPost()
    {
		$result = $this->select('t.title, t.timestamp, t.id')
		->join('threads as t', 'forums.id=t.forum_id')
		->join('threads as t2', 'forums.id=t2.forum_id AND (t.timestamp < t2.timestamp OR (t.timestamp = t2.timestamp AND t.id < t2.id))'
		, 'left outer')
		->where('t2.id IS NULL')
		->findAll();
---
SELECT `t`.`title`, `t`.`timestamp`, `t`.`id`
FROM `forums`
JOIN `threads` as `t` ON `forums`.`id`=`t`.`forum_id`
LEFT OUTER JOIN `threads` as `t2` ON `forums`.`id`=`t2`.`forum_id` AND (`t`.`timestamp` < `t2`.`timestamp` OR (`t`.`timestamp` = `t2`.`timestamp` AND `t`.`id` < t2.id))
WHERE `t2`.`id` IS NULL