app/Models/RepliesModel.php

	public function replyOfReply(){
		$result = $this->select('replies.id, u.username, replies.content')
		->join('users as u', 'u.id=replies.user_id')
		->join('replies as r2', 'replies.id = r2.reply_id','left')
		->where('r2.reply_id != 0')
		->findAll();
---
SELECT `replies`.`id`, `u`.`username`, `replies`.`content`
FROM `replies`
JOIN `users` as `u` ON `u`.`id`=`replies`.`user_id`
LEFT JOIN `replies` as `r2` ON `replies`.`id` = `r2`.`reply_id`
WHERE `r2`.`reply_id` !=0